Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--deegree_quickstart.tmx
Source language: en
Languages: ja

source: deegree Quickstart
ja: deegreeクイックスタート

source: *deegree* is open source software for spatial data infrastructures and the geospatial web. *deegree* is a Java application for serving maps (and vector data) for other clients to show.
ja: *deegree*は、空間データインフラストラクチャと地理空間Webのためのオープンソースソフトウェアです。*deegree*は、他のクライアントが表示するマップ(およびベクタデータ)を提供するJavaアプリケーションです。

source: Available components are:
ja: 利用可能なコンポーネント:

source: *deegree 3* is the new generation of the deegree Java framework for GIS applications and OGC-service implementations. It can be used to build web-based geospatial-data-infrastructures (GDI).
ja: *deegree3*は、deegree Javaフレームワークの新世代であり、GISアプリケーションとOGCサービス実装のためのものです。Webベースの地理空間データインフラストラクチャ(GDI)の構築に使用できます。

source: Start deegree 3 webservices
ja: deegree3 webサービスを開始

source: Choose *'Start deegree'* from the :menuselection:`Geospatial --> Web Services --> deegree` menu. The application will take a few moments to start up.
ja: :menuselection:`Geospatial-->Web Services-->deegree`メニューから*'deegreeを開始'*を選択します。アプリケーションの起動には少し時間がかかります。

source: Firefox opens the *deegree 3 services console*. (You can also open this manually by pointing your browser to http://localhost:8033). This is a simple web-based GUI for editing the configuration files of the *deegree workspace*.
ja: Firefoxは*deegree3サービス コンソール*を開きます。(ブラウザでhttp://localhost:8033)を選択して手動で開くこともできます。これは、*deegree作業フォルダ*の設定ファイルを編集するためのシンプルなWebベースのGUIです。

source: Load a workspace
ja: 作業フォルダを読み込む

source: *deegree 3* uses configurations conformant to all *deegree 3* based webservices. Those configurations are stored in the workspace.
ja: *deegree3*はすべての*deegree3*ベースのウェブサービスに準拠した設定を使用しています。これらの設定は作業フォルダに保存されています。

source: To manage the included and ready-to-use workspaces, click *'workspaces'* on the left side. You are now in the workspace management of the running *deegree* instance. You can see which workspace is currently active (only one can be active at a time) workspace, inactive locally available workspaces and offical workspaces which can be imported if you have a internet connection.
ja: 含まれているすぐに使用できるワークスペースを管理するには、左側の[*'workspaces'*]をクリックします。これで、実行中の*deegree*インスタンスの作業フォルダ管理が開始されました。現在アクティブな作業フォルダ(一度に1つしかアクティブにできない)、非アクティブなローカルで利用可能なワークスペース、およびインターネット接続がある場合にインポートできるオフラインのワークスペースを確認できます。作業フォルダ

source: Press start on the *deegree-inspire-workspace*.
ja: *deegree-inspire-workspace*の開始を押してください。

source: This workspace includes an example configuration for INSPIRE View- and Download-Services. It consists of a transactional WFS (2.0.0 and 1.1.0) for all Annex I Data Themes and a WMS (1.3.0 and 1.1.1) which serves three layers of those Annex I Data Themes. Included are some harmonized dutch administrative units, cadastral parcels and addresses. The WFS in this example acts as an INSPIRE Download service (direct access) and outputs valid, harmonized INSPIRE GML. Additionally it supports multiple request types and queries.
ja: この作業フォルダには、INSPIREビュー・ダウンロードサービスの設定例が含まれています。すべてのAnnex Iデータテーマ用のトランザクションWFS(2.0.0および1.1.0)と、これらのAnnex Iデータテーマの3つのレイヤを提供するWMS(1.3.0および1.1.1)で構成されています。いくつかの調和されたオランダの行政単位、地籍区画、住所が含まれています。この例のWFSはINSPIREダウンロードサービス(直接アクセス)として動作し、有効で統一されたINSPIRE GMLを出力します。さらに、複数のリクエストタイプとクエリをサポートしています。

source: This workspace loads harmonized INSPIRE GML from local files. This can easily changed to PostGIS, Oracle Spatial or Microsoft SQL Server as backend.
ja: この作業フォルダは、ローカルのファイルから調和されたINSPIRE GMLをロードします。これは、バックエンドとしてPostGIS、Oracle Spatial、Microsoft SQL Serverに簡単に変更できます。

source: View a map
ja: マップビュー

source: Click on *'see layers'* to open a simple map-client. The service is configured to visualize the data and a basemap (rendered by `OpenStreetMap <https://www.openstreetmap.org/>`_).
ja: *'see layers'*をクリックして、簡単なマップクライアントを開きます。このサービスは、データとベースマップ(`OpenStreetMap<https://www.openstreetmap.org/>`_)を視覚化するように設定されています。

source: Click on the **+** on the right side to open a layer tree showing all available layers. You can activate the INSPIRE layer served by the deegree WMS here.
ja: 右側の**+**をクリックすると、レイヤの木が開き、利用可能なすべてのレイヤが表示されます。deegree WMSが提供するINSPIREレイヤは、ここで有効化できます。

source: The map client is based on `OpenLayers <https://openlayers.org/>`_. You can pan through the map holding the left mouse button and drag the map. Zooming is possible via mouse wheel or the navigation elements on the left side.
ja: マップクライアントは、`OpenLayers<https://openlayers.org/>`_に基づいています。マウスの左ボタンを押したままマップを移動し、マップをドラッグできます。ズームは、マウスホイールまたは左側のナビゲーション要素を使用して可能です。

source: More information and step-by-step tutorials about the INSPIRE workspace can be found in the deegree `documentation <https://download.deegree.org/documentation/3.4.1/html/lightly.html#example-workspace-1-inspire-network-services>`__.
ja: INSPIRE作業フォルダに関する詳細情報と段階的なチュートリアルは、deegree`文書 <https://download.deegree.org/documentation/3.4.1/html/lightly.html#example-workspace-1-inspire-network-services>`__にあります。

source: What next?
ja: 次のステップ

source: This was just a short introduction to the features of deegree 3. There is more information in the demo installations and on the deegree website.
ja: これはdeegree3の機能を簡単に紹介したものです。詳細については、デモインストールとdeegree Webサイトを参照してください。

source: deegree online demo - Available here: https://www.deegree.org/demo/
ja: deegreeオンラインデモ-利用可能:https://www.deegree.org/demo/

source: deegree website - Available here: https://www.deegree.org
ja: deegree Webサイト-利用可能:https://www.deegree.org
